<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadContent</key>
    <array>
      <dict>
        <key>PayloadContent</key>
        <dict>
          <key>Challenge</key>
          <string>micromdm</string>
          <key>Key Type</key>
          <string>RSA</string>
          <key>Key Usage</key>
          <integer>5</integer>
          <key>Keysize</key>
          <integer>2048</integer>
          <key>Name</key>
          <string>Device Management Identity Certificate</string>
          <key>Subject</key>
          <array>
            <array>
              <array>
                <string>O</string>
                <string>MicroMDM</string>
              </array>
            </array>
            <array>
              <array>
                <string>CN</string>
                <string>MicroMDM Identity (%ComputerName%)</string>
              </array>
            </array>
          </array>
          <key>URL</key>
          <string>https://5054-8-18-221-137.ngrok.io/scep</string>
        </dict>
        <key>PayloadDescription</key>
        <string>Configures SCEP</string>
        <key>PayloadDisplayName</key>
        <string>SCEP</string>
        <key>PayloadIdentifier</key>
        <string>com.github.micromdm.micromdm.enroll.scep</string>
        <key>PayloadOrganization</key>
        <string>MicroMDM</string>
        <key>PayloadType</key>
        <string>com.apple.security.scep</string>
        <key>PayloadUUID</key>
        <string>DDB3DABB-D644-4CD1-92AA-6D2BE2E6D0F8</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
      </dict>
      <dict>
        <key>AccessRights</key>
        <integer>8191</integer>
        <key>CheckInURL</key>
        <string>https://5054-8-18-221-137.ngrok.io/mdm/checkin</string>
        <key>CheckOutWhenRemoved</key><true/>
        <key>IdentityCertificateUUID</key>
        <string>DDB3DABB-D644-4CD1-92AA-6D2BE2E6D0F8</string>
        <key>PayloadDescription</key>
        <string>Enrolls with the MDM server</string>
        <key>PayloadIdentifier</key>
        <string>com.github.micromdm.micromdm.enroll.mdm</string>
        <key>PayloadOrganization</key>
        <string>MicroMDM</string>
        <key>PayloadType</key>
        <string>com.apple.mdm</string>
        <key>PayloadUUID</key>
        <string>29258971-E37F-4F27-AE37-90A241AF4C31</string>
        <key>PayloadVersion</key>
        <integer>1</integer>
        <key>ServerCapabilities</key>
        <array>
          <string>com.apple.mdm.per-user-connections</string>
          <string>com.apple.mdm.bootstraptoken</string>
        </array>
        <key>ServerURL</key>
        <string>https://5054-8-18-221-137.ngrok.io/mdm/connect</string>
        <key>SignMessage</key><true/>
        <key>Topic</key>
        <string>com.apple.mgmt.External.92f0a15f-4fae-4f62-9418-c14b30fd348d</string>
      </dict>
    </array>
    <key>PayloadDescription</key>
    <string>The server may alter your settings</string>
    <key>PayloadDisplayName</key>
    <string>Enrollment Profile</string>
    <key>PayloadIdentifier</key>
    <string>com.github.micromdm.micromdm.enroll</string>
    <key>PayloadOrganization</key>
    <string>MicroMDM</string>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>0CC9C6CA-D99E-4108-ABF1-4075FC90FF35</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
  </dict>
</plist>
